//Чтобы проверить имеют ли файлы изменения необходимо ввести команду git status
//Чтобы подготовить изменненые файлы к записи вводим команду git add .(для всех файлов) или git add и перечисляем названия файлов через пробел
//данная команда добавляет файлы в область stage
//После если мы проверим файлы командой git status файлы будут подсвечиваться зеленным цветом
//Затем мы должны записать комментарии описывающие изменения которые мы произвели, командой git commit -m "комментраии"
//Чтобы просмотреть все записи и комментарии необходимо воспользоваться командой git log
//Чтобы посмотреть краткую информацию о записях и комментрариях вводим команду git log --oneline
//Чтобы теперь записать наши изменения в репозиторий на github необходимо ввести команду git push "ссылка на репозиторий" "ветка"
//для понимания ветки на которой вы введете разработку можно ввести команду git branch
//после записываем в репозиторий командой git push "url из git remote -v или просто origin" "ветка из git branch"
//
